Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Hochdruckpumpen für Waschmaschinen und -anlagen
en: High-pressure pumps for washing appliances and installations

source: Pflüge als landwirtschaftliche Maschinen
en: Ploughs being agricultural machines

source: Gasbetriebene Metallschneider
en: Metal cutters (Gas operated -)

source: Metallbearbeitungsanlagen [Maschinen]
en: Metal finishing plant [machines]

source: Zahnräder für Wasserfahrzeuggetriebe
en: Sprockets for water vehicle gearing

source: Elektrische Teppichkehrer
en: Electric carpet sweepers

source: Entgratwerkzeuge [Maschinenteile]
en: Deburring tools [parts of machines]

source: Drehachsen [Maschinen]
en: Rotating centres [machines]

source: Drucksiebe aus textilen Materialien [Maschinenteile]
en: Screens for the printing of textile materials [parts of machines]

source: Schraubenfräsen [Maschinen]
en: Screw milling cutters [machines]

source: Schraubenfräsen [Maschinenteile]
en: Screw milling cutters [parts of machines]

source: Rohrmühlen [zur Metallbearbeitung]
en: Tubing mills [for metalworking]

source: Hydraulische Antriebe für Maschinen und Motoren
en: Hydraulic controls for machines, motors and engines

source: Elektrische Bohnermaschinen und -apparate
en: Machines and apparatus for wax-polishing, electric

source: Bremsbacken für Maschinen
en: Brake linings for machines

source: Scheibenbremsen für Maschinen
en: Disc brakes for machines

source: Bohrmaschinen und deren Teile
en: Drilling machines and parts therefor

source: Kurbeln [Teile von Wasserfahrzeugen]
en: Cranks [parts of water vehicles]

source: Hämmer [Maschinenteile]
en: Hammers [parts of machines]

source: Pneumatische Türschließer
en: Door closers, pneumatic

source: Metalldichtungen für Fahrzeugmotoren
en: Metal engine gaskets for vehicles

source: Gasbetriebene Stromgeneratoren
en: Gas operated power generators

source: Planiermaschinen für Bleche aus Metall
en: Sheet metal flattening machines

source: Greifzangen für Folien [Maschinen]
en: Sheeting grippers [machines]

source: Elektrische Schuhputzmaschinen
en: Shoe cleaners [brushes, electric]

source: Presswalzen [Maschinenteile]
en: Press rollers [parts of machines]

source: Abscheider zum Trennen von Feststoffen von Flüssigkeiten
en: Separators for separating solids from liquids

source: Elektromotoren für Maschinen
en: Electric driving motors for machines

source: Poliermaschinen für Reis- oder Gerstenkörner
en: Polishing machines for rice or barley

source: Traktorgezogene Eggen
en: Tractor-towed harrows

source: Pulverauftraggeräte für Druckereimaschinen
en: Powder applying apparatus for printing machines

source: Elektrische Schneidwerkzeuge
en: Cutting tools being power-operated

source: Nicht handbetriebene Kaffeemühlen
en: Coffee grinders, other than hand-operated

source: Motoren für Fahrzeugmodelle
en: Engines for model vehicles

source: Auspuffkrümmer für Motoren
en: Exhaust manifold for engines

source: Auspuffrohre für Landfahrzeuge
en: Exhaust pipes for land vehicles

source: Matrizenkästen für Druckereizwecke
en: Boxes for matrices [printing]

source: Sinterhartmetallspitzen [Werkzeuge für Maschinen]
en: Cemented carbide tips [tools for machines]

source: Fleischwölfe [elektrische Maschinen]
en: Meat mincing machines [electric machines]

source: Schleifwerkzeuge für Maschinen
en: Abrading tools for use with machines

source: Schleifscheiben [Maschinen]
en: Abrasive grinding wheels [machines]

source: Schleifinstrumente [Werkzeuge für Maschinen]
en: Abrasive instruments [tools for machines]

source: Laderampen aus Metall [Maschinen]
en: Metal loading ramps [machines]

source: Metallschweißmaschinen [elektrisch]
en: Metal welding machines [electric]

source: Nicht handbetriebene Mühlen für Haushaltszwecke
en: Mills for household purposes, other than hand-operated

source: Karbid-Bohreinsätze für Maschinen
en: Carbide drill bits for machines

source: Elektrische Teppichklopfer
en: Electrical beaters for carpets

source: Rohrentgrater [Maschinenteile]
en: Tube reamers [parts of machines]

source: Durch Druckänderung betätigte Ventile
en: Valves operated by changes in pressure

source: Antriebswellen für Luftfahrzeuge
en: Transmission shafts for air vehicles

source: Fahrzeuggetriebe für Luftfahrzeuge
en: Transmissions for air vehicles

source: Webschützen [Maschinenteile]
en: Shuttles [parts of machines]
